### 1.

In [1]:
import pandas as pd

In [4]:
data = [4, 8, 15, 16, 23, 42]
s = pd.Series(data)
print(s)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### 2.

In [6]:
e = [1,2,3,4,5,6,7,8,9,10]
f = pd.Series(e)
print(f)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

### 3.

In [10]:
g = {'Name' : ['Alice', 'Bob', 'Claire'],
    'Age' : [25, 30, 27],
    'Gender' : ['Female', 'Male', 'Female']
}

a = pd.DataFrame(g)
print(a)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### 4.

**A DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. It is like a spreadsheet or a SQL table. It has both rows and columns, and can be thought of as a dictionary of Series (where each column of a DataFrame is a Series).**

**A Series, on the other hand, is a 1-dimensional labeled array capable of holding any data type. It can be thought of as a single column of a DataFrame, and has only one axis.It can be created using various inputs such as lists, numpy arrays, and dictionaries.**

In [11]:
J = {'Name' : ['Alice', 'Bob', 'Claire'],
    'Age' : [25, 30, 27],
    'Gender' : ['Female', 'Male', 'Female'],
     'Education': ['POST-GRAD', 'PHD', 'PHD']
}

E = pd.DataFrame(J)
print(E)

     Name  Age  Gender  Education
0   Alice   25  Female  POST-GRAD
1     Bob   30    Male        PHD
2  Claire   27  Female        PHD

In [12]:
E['Name']

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

### 5.

**I can use 4 common functions to analysis the data. Those functions are:- head, dtypes, tail, columns.**

In [14]:
u = {'Name' : ['Alice', 'Bob', 'Claire'],
    'Age' : [25, 30, 27],
    'Gender' : ['Female', 'Male', 'Female'],
     'Education': ['POST-GRAD', 'PHD', 'PHD'],
     'Profession' : ['Prof', 'CEO', 'Managing Director']
}

t = pd.DataFrame(u)

In [17]:
t.columns

Index(['Name', 'Age', 'Gender', 'Education', 'Profession'], dtype='object')

In [19]:
t.head()

     Name  Age  Gender  Education         Profession
0   Alice   25  Female  POST-GRAD               Prof
1     Bob   30    Male        PHD                CEO
2  Claire   27  Female        PHD  Managing Director

In [21]:
t.tail()

     Name  Age  Gender  Education         Profession
0   Alice   25  Female  POST-GRAD               Prof
1     Bob   30    Male        PHD                CEO
2  Claire   27  Female        PHD  Managing Director

In [23]:
t.dtypes

Name          object
Age            int64
Gender        object
Education     object
Profession    object
dtype: object

### 6.

**In the pandas library of Python, both Series and DataFrame are mutable in nature.**

### 7.

In [24]:
fruit = pd.Series(['APPLE', 'ORANGE', 'MANGO', 'GUAVA'])
price = pd.Series([8, 9, 11, 6])

df = pd.DataFrame({'Fruits': fruit, 'Price': price})

In [26]:
print(df)

   Fruits  Price
0   APPLE      8
1  ORANGE      9
2   MANGO     11
3   GUAVA      6